# Pandas ??

Pandas is a Python module for working with tabular data (i.e., data in a table with rows and columns). 
Tabular data has a lot of the same functionality as SQL or Excel, but Pandas adds the power of Python.

### What are some differences between the Python data science modules Pandas, Numpy and Matplotlib?

Although they may appear similar, these modules have unique purposes and functionalities.

The Pandas module is used for working with tabular data. It allows us to work with data in table form, such as in CSV or SQL database formats. 
We can also create tables of our own, and edit or add columns or rows to tables. Pandas provides us with some powerful objects like DataFrames 
and Series which are very useful for working with and analyzing data.

The Numpy module is mainly used for working with numerical data. It provides us with a powerful object known as an Array. 
With Arrays, we can perform mathematical operations on multiple values in the Arrays at the same time, and also perform operations between 
different Arrays, similar to matrix operations.

Last, but not least, the Matplotlib module is used for data visualization. It provides functionality for us to draw charts and graphs, 
so that we can better understand and present the data visually.

These modules have different purposes and functionality they excel at, and together they allow us to analyze, manipulate and visualize data 
in very useful ways.

In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('D:\GIT_Repositories\pandas\shoefly_orders.csv')
df.head()

<>:1: SyntaxWarning: invalid escape sequence '\G'
<>:1: SyntaxWarning: invalid escape sequence '\G'
C:\Users\MeghaPrateek\AppData\Local\Temp\ipykernel_12176\664994216.py:1: SyntaxWarning: invalid escape sequence '\G'
  df = pd.read_csv('D:\GIT_Repositories\pandas\shoefly_orders.csv')

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown

In [55]:
# to fix the above warning ---- SyntaxWarning: invalid escape sequence '\G'

# make the string a raw-string ---> r'D:\GIT_Repositories\pandas\shoefly_orders.csv'

df = pd.read_csv(r'D:\GIT_Repositories\pandas\shoefly_orders.csv')
df.head()

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown

#### Let's examine the first 10 rows of our data!

In [7]:
df.head(10)

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown
5,52386.0,Julie,Marsh,JulieMarsh59@gmail.com,sandals,fabric,black
6,20487.0,Thomas,Jensen,TJ5470@gmail.com,clogs,fabric,navy
7,76971.0,Janice,Hicks,Janice.Hicks@gmail.com,clogs,faux-leather,navy
8,21586.0,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown
9,62083.0,Frances,Palmer,FrancesPalmer50@gmail.com,wedges,leather,white

Let's select everyone who ordered black sandals.

In [8]:
filt = ( df['shoe_type'] == 'sandals' )
df.loc[filt]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
5,52386.0,Julie,Marsh,JulieMarsh59@gmail.com,sandals,fabric,black

In [9]:
filt = ( df['shoe_type'] == 'sandals' ) & ( df['shoe_color'] == 'black' )
df.loc[filt]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
5,52386.0,Julie,Marsh,JulieMarsh59@gmail.com,sandals,fabric,black

Let's see what Andrew Banks ordered.

In [11]:
filt = ( df['first_name'] == 'Andrew' ) & ( df['last_name'] == 'Banks' )
df.loc[filt]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown

# Create a DataFrame

DataFrame is an object that stores data as rows and columns

You can think of a DataFrame as a spreadsheet or as a SQL table. DataFrames have rows and columns. 

Each column has a name, which is a string. Each row has an index, which is an integer. 

DataFrames can contain many different data types: strings, ints, floats, tuples, etc.

You can manually create a DataFrame or fill it with data from a CSV, an Excel spreadsheet, or a SQL query.

### manually create a dataframe

You can pass in a dictionary to pd.DataFrame(). Each key is a column name and each value is a list of column values.

You run an online clothing store called Panda’s Wardrobe. 
You need a DataFrame containing information about your products.

Create a DataFrame with the following data that your inventory manager sent you

Product ID	Product Name	Color
1	        t-shirt	        blue
2	        t-shirt	        green
3	        skirt	        red
4	        skirt	        black

In [16]:
Wardrobe_df = pd.DataFrame( {
    "Product ID" : [1, 2, 3, 4],
    "Product Name" : ['t-shirt', 't-shirt', 'skirt', 'skirt'],
    "Color" : ['blue', 'green', 'red', 'black']   
})
Wardrobe_df

   Product ID Product Name  Color
0           1      t-shirt   blue
1           2      t-shirt  green
2           3        skirt    red
3           4        skirt  black

# Create a DataFrame II

You can also add data using lists.

For example, you can pass in 

a list of lists ---> where each one represents a row of data. 

Use the keyword argument columns to pass a list of column names.

In [17]:
df2 = pd.DataFrame( [
    [1,  'San Diego', 100],
    [2, 'Los Angeles', 120],
    [3, 'San Francisco', 90],
    [4, 'Sacramento', 115]
],
 columns = ['Store ID', 'Location', 'Number of Employees']
)

In [18]:
df2.head()

   Store ID       Location  Number of Employees
0         1      San Diego                  100
1         2    Los Angeles                  120
2         3  San Francisco                   90
3         4     Sacramento                  115

# When should I create a Pandas dataframe using a dictionary or a list?

You can create Pandas dataframes using either a dictionary or a list of lists, but depending on several factors, using one can be preferred 
over the other.

Using dictionaries can be much faster, since you can just include the column names as the keys, and include the values of the column as a list 
for the keys. However, a disadvantage of using a dictionary is that the columns will not preserve the order that you entered them, and 
will default to alphabetical ordering instead. This is important to keep in mind especially if the column order is important.

Using a list of lists allows you to enter each row of data one at a time as a separate list, but it may take longer than using a dictionary, 
since column names must be added as a separate list after the rows are added. However, a list of lists allows you to order the column names 
specifically, which can be very important.

In [ ]:
# Comma Separated Variables (CSV)

most of the time, we’ll be working with datasets that already exist. One of the most common formats for big datasets is the CSV.

CSV (comma separated values) is a text-only spreadsheet format.

You can find CSVs in lots of places:
1. Online datasets (here’s an example from data.gov)
2. Export from Excel or Google Sheets
3. Export from SQL

The first row of a CSV contains column headings. All subsequent rows contain values. 

Each column heading and each variable is separated by a comma :

column1,column2,column3
value1,value2,value3

The above example CSV represents the following table:

column1	column2	column3
value1	value2	value3

In [20]:
# read cupcakes.csv

cupcakes_df = pd.read_csv(r"D:\GIT_Repositories\pandas\cupcakes.csv")
cupcakes_df

             name cake_flavor frosting_flavor             topping
0  Chocolate Cake   chocolate       chocolate  chocolate shavings
1   Birthday Cake     vanilla         vanilla   rainbow sprinkles
2     Carrot Cake      carrot    cream cheese             almonds

# In a CSV file, does spacing matter, such as before or after commas?

Yes, in most cases for CSV files, Pandas will separate the data by the commas, and will keep any spaces that were included 
before or after a comma.

Because of this, it is important that when creating a CSV file, each value should only be separated by a comma without any 
unwanted whitespace before or after the commas, since they will not be removed automatically.

Example CSV row :
-----------------
name, date, location
For the above example, when reading the data from this CSV, it will include the leading spaces for ’ date’ and ’ location’.

## Loading and Saving CSVs

When you have data in a CSV, you can load it into a DataFrame in Pandas using .read_csv():
pd.read_csv('cupcakes.csv')

We can also save data to a CSV, using .to_csv(). 
df.to_csv('cupcakes.csv')

By default, .to_csv() -- will save the CSV file in your current directory.

In [21]:
print(cupcakes_df)

             name cake_flavor frosting_flavor             topping
0  Chocolate Cake   chocolate       chocolate  chocolate shavings
1   Birthday Cake     vanilla         vanilla   rainbow sprinkles
2     Carrot Cake      carrot    cream cheese             almonds

## In Pandas, what happens if there are empty or missing values in a CSV file and we try to read it?

If the CSV file contains missing values, then when we read the file, it will populate the missing cells with NaN. 

NaN is short of “Not a Number”, and used to signify missing values.

If needed, we can replace these NaN values with an actual value, like 0 or an empty string '', using the fillna() method. 
Or, we can drop any rows that contain an empty value, using dropna().

For example, if we had a CSV file containing the following:

name,flavor,topping
,chocolate,chocolate shavings
Birthday Cake,,gold sprinkles

When we read this file using Pandas read_csv, it will load it like so, filling in the missing values with NaN.

name             flavor        topping
NaN              chocolate     chocolate shavings
Birthday Cake    NaN           gold sprinkles

## Inspect a DataFrame

When we load a new DataFrame from a CSV, we want to know what it looks like.

If it’s a small DataFrame, you can display it by typing  ---> print(df).

If it’s a larger DataFrame, it’s helpful to be able to inspect a few items without having to look at the entire DataFrame.
df.head() ---> gives the first 5 rows of a DataFrame

If you want to see more rows, you can pass in the positional argument n. 
df.head(10) ---> would show the first 10 rows.

df.info() ----> gives some statistics for each column.

In [23]:
cupcakes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   name             3 non-null      object
 1   cake_flavor      3 non-null      object
 2   frosting_flavor  3 non-null      object
 3   topping          3 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

### What information is returned when we run df.info()?

In [ ]:
When using .info() in Pandas, it will return -
information about the dataframe including the data types of each column and memory usage of the entire data.

To see this better, let’s observe the information being printed out.

First, it will print out the data type of the object, which is a Pandas dataframe.
<class 'pandas.core.frame.DataFrame'>

Next, it will display the number of entries, or rows, in the dataframe, and the range of values of the row indexes. 
Here the first index is 0 and the last index is 219.
RangeIndex: 220 entries, 0 to 219

After this, it prints out the information regarding each data column, including the column names, number of entries, whether they have non-null 
values, and the data type.
id 220 non-null int64

After this, it will display overall how many columns there are per datatype in the dataframe.
dtypes: float64(1), int64(2), object(2)

And finally, it shows the memory usage of the dataframe.
memory usage: 8.7+ KB

## Select Columns

In [ ]:

i.e. select parts of those datasets that are interesting or important to our analyses.

There are two possible syntaxes for selecting all values from a column:

Method 1: Select the column as if you were selecting a value from a dictionary using a key.  ---> df['Column_Name']

Method 2: If the name of a column follows all of the rules for a variable name (doesn’t start with a number, doesn’t contain spaces or special characters, etc.), 
then you can select it using the dot notation ----> df.column_name

Note: When we select a single column, the result is called a Series.

In [ ]:
# Example:

'''
The DataFrame df represents data collected by four health clinics run by the same organization. 

Each row represents a month from January through June and shows the number of appointments made at four different clinics.

You want to analyze what’s been happening at the North location. 

Create a variable called clinic_north that contains ONLY the data from the column clinic_north

'''

In [24]:
health_clinics_df = pd.DataFrame([
  ['January', 100, 100, 23, 100],   # month and no of appointment at each of the 4 clinics
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 
           'clinic_east',
           'clinic_north', 
           'clinic_south',
           'clinic_west']
)

to analyze what’s been happening at the North location.

In [41]:
north_clinics_df = health_clinics_df['clinic_north']
north_clinics_df

0    100
1     45
2     96
3     80
4     54
5    109
Name: clinic_north, dtype: int64

In [42]:
print(type(health_clinics_df))

<class 'pandas.core.frame.DataFrame'>

In [43]:
print(type(north_clinics_df))

<class 'pandas.core.series.Series'>

## How is a Pandas series different from a dataframe???

In [ ]:
In Pandas -

Series:
========

a series is a one-dimensional object that contains any type of data, similar in ways to a Numpy array.

Series objects have a single axis label, like a column title, which is the index of the series. 

A series is essentially a single column.

# Creating a series
clinic_east = pd.Series([100, 51, 81, 80, 51, 112])


DataFrame:
==========

A dataframe is a two-dimensional object that can hold multiple columns of different types of data. 
They are similar to a table in SQL.

A single column of a dataframe is a series, and a dataframe is a container of two or more series objects.

# Creating a DataFrame
df = pd.DataFrame ([
  ['January', 100, 100],
  ['February', 51, 45],
  ['March', 81, 96]],
  columns=["month", "clinic_east", "clinic_north"]
)

## Selecting Multiple Columns

In [ ]:
To select two or more columns from a DataFrame, we use a list of the column names.

Note: Make sure that you have a double set of brackets ( [[]] ), or this command won’t work!

#### you want to compare visits to the Northern and Southern clinics.

Create a variable called clinic_north_south that contains ONLY the data from the columns clinic_north and clinic_south.

In [45]:
clinic_north_south = health_clinics_df[['clinic_north', 'clinic_south']]
clinic_north_south

   clinic_north  clinic_south
0           100            23
1            45           145
2            96            65
3            80            54
4            54            54
5           109            79

### When we select multiple columns, do we get a Series or a DataFrame?

In [48]:
print(type(clinic_north_south))  # its data frame

<class 'pandas.core.frame.DataFrame'>

## Can we select columns of a Pandas dataframe in any order?

In [ ]:
You certainly can! 

When selecting multiple columns from a DataFrame, you can order the columns however you would like them to appear. 

This is particularly useful because if we wanted to see the data in a certain way different from the original column 
order, we can reorder them in the output however we need.

In [52]:
# Example:

df_names = pd.DataFrame([
  ['Doe', 'Jane'],
  ['Law', 'Bob']],
  columns = ['last_name', 'first_name'])

In [54]:
df_names

  last_name first_name
0       Doe       Jane
1       Law        Bob

In [53]:
# We can select the first_name column first, 
# then the last_name.
full_names = df_names[['first_name', 'last_name']]
full_names

  first_name last_name
0       Jane       Doe
1        Bob       Law

## Select Rows

In [57]:
orders_df = pd.read_csv(r'D:\GIT_Repositories\pandas\shoefly_orders.csv')
orders_df

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown
5,52386.0,Julie,Marsh,JulieMarsh59@gmail.com,sandals,fabric,black
6,20487.0,Thomas,Jensen,TJ5470@gmail.com,clogs,fabric,navy
7,76971.0,Janice,Hicks,Janice.Hicks@gmail.com,clogs,faux-leather,navy
8,21586.0,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown
9,62083.0,Frances,Palmer,FrancesPalmer50@gmail.com,wedges,leather,white
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
Maybe our Customer Service department has just received a message from Joyce Waller, 
so we want to know exactly what she ordered. 
i.e. We want to select this single row of data.

In [59]:
# DataFrames are zero-indexed, meaning that we start with the 0th row and count up from there. 

# Joyce Waller’s order is the 2nd row.

orders_df.iloc[2]

id                              91987.0
first_name                        Joyce
last_name                        Waller
email            Joyce.Waller@gmail.com
shoe_type                       sandals
shoe_material                    fabric
shoe_color                        black
Name: 2, dtype: object

In [ ]:
Scenario:  Selecting Row

You’re getting ready to staff the clinic for March this year. 

You want to know how many visits took place in March last year, to help you prepare.

Write a command that will produce a Series made up of the March data from df from all four clinic sites and 
save it to the variable march.

In [60]:
health_clinics_df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [62]:
# March month index = 2

march = health_clinics_df.iloc[2]
march

month           March
clinic_east        81
clinic_north       96
clinic_south       65
clinic_west        96
Name: 2, dtype: object

In [64]:
print(type(march))

<class 'pandas.core.series.Series'>

## How come the result of the .iloc is not a list? Why does it show a series?

In [ ]:
When using iloc in Pandas, it will return a specified row, but in the form of a Series.

The left column in the result is composed of indexes which are the column names from the dataframe.

And the right column is composed of the values for each column in the row of data.

This is a helpful feature in Pandas because it displays all the information about the columns and values of a row 
in a clear way

We may think of iloc() for a single row is taking that row of data from the data frame and transposing it into 
a column (i.e., series).

## Selecting Multiple Rows

Here are some different ways of selecting multiple rows:

In [ ]:
select all rows starting at the 3rd row and up to but not including the 7th row 
(i.e., the 3rd row, 4th row, 5th row, and 6th row)

In [65]:
orders_df.iloc[3:7]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown
5,52386.0,Julie,Marsh,JulieMarsh59@gmail.com,sandals,fabric,black
6,20487.0,Thomas,Jensen,TJ5470@gmail.com,clogs,fabric,navy

In [ ]:
select all rows up to, but not including the 4th row (i.e., the 0th, 1st, 2nd, and 3rd rows)

In [66]:
orders_df.iloc[:4]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red

In [ ]:
select the rows starting at the 3rd to last row and up to and including the final row

In [67]:
orders_df.iloc[-3:]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
8,21586.0,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown
9,62083.0,Frances,Palmer,FrancesPalmer50@gmail.com,wedges,leather,white
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Example 2:

In [ ]:
One of your doctors thinks that there are more clinic visits in the late Spring.

Write a command that will produce a DataFrame made up of the data for April, May, and June from df 
for all four sites (rows 3 through 6), and save it to april_may_june.

In [68]:
health_clinics_df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [71]:
april_may_june = health_clinics_df.iloc[3:6]

In [72]:
print(april_may_june)

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

###  When using iloc to select ranges of Pandas dataframe rows, can we skip rows? 

You can! Selecting multiple rows using .iloc is very similar to list slicing in Python. There are a few ways to select rows using iloc.

To select just a single row, we pass in a single value, the index. For example with Python lists,
numbers[0] # First element of numbers list

And with Dataframes, we would do something similar,
orders.iloc[0].

Selecting a range of elements of a list and a range of rows in Pandas is also very similar.

# Python list
numbers[3:7]

# Pandas
orders.iloc[3:7]

To skip a certain number of indexes per index, we can include a third, step, value.

# This selects values at indexes 0, 3, 6, 9.
# Python list
numbers[0:10:3]

# This selects rows at indexes 0, 3, 6, 9
# Pandas
orders.iloc[0:10:3]

In [80]:
# For instance, can we choose to select every second or third row only?

# To select every 2nd row --- i.e 0, 2, 4, 6 --- even indexed rows

health_clinics_df.iloc[0:6:2]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96
4      May           51            54            54          154

In [81]:
# To select every 3rd row --- i.e 0, 2, 4, 6 --- even indexed rows

health_clinics_df.iloc[0:6:3]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
3    April           80            80            54          180

# Select Rows with Logic I

select a subset of a DataFrame by using logical statements:  

df[ df.MyColumnName == desired_column_value ]

In [83]:
customers_df = pd.read_csv(r'D:\GIT_Repositories\pandas\Customers.csv')
customers_df

           name           address         phone  age
0  Martha Jones      123 Main St.  234-567-8910   28
1    Rose Tyler    456 Maple Ave.  212-867-5309   22
2   Donna Noble      789 Broadway  949-123-4567   35
3      Amy Pond  98 West End Ave.  646-555-1234   29
4  Clara Oswald  54 Columbus Ave.  714-225-1957   31

### To select all rows where the customer’s age is greater or equal to 30.

In [87]:
customers_df[ customers_df.age >= 30]

           name           address         phone  age
2   Donna Noble      789 Broadway  949-123-4567   35
4  Clara Oswald  54 Columbus Ave.  714-225-1957   31

In [89]:
# Customer age < 30

customers_df[ customers_df.age < 30]

           name           address         phone  age
0  Martha Jones      123 Main St.  234-567-8910   28
1    Rose Tyler    456 Maple Ave.  212-867-5309   22
3      Amy Pond  98 West End Ave.  646-555-1234   29

### Excercise

In [ ]:
You’re going to staff the clinic for January of this year. 

You want to know how many visits took place in January of last year, to help you prepare.

Create variable january using a logical statement that selects the row of df where the 'month' column is 'January'.

In [91]:
health_clinics_df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [94]:
january = health_clinics_df[health_clinics_df.month == 'January']

In [95]:
print(january)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

### Question: In Pandas, can we compare the values of two columns in the same dataframe?

In [ ]:

Yes, you can compare values of different columns of a dataframe within the logical statement.
    
Say for example, you had data that stored the buy price and sell price of stocks in two columns.
If you wanted to select rows of the data for which the buy price was less than the sell price,
you could compare their values in the logical statement.

# This logical statement is comparing
# the values of column `buy_price`
# and column `sell_price`
gains = df[df.buy_price < df.sell_price]

# Select Rows with Logic II

We can also combine multiple logical statements, as long as each statement is in parentheses.

In Python, | means “or” and & means “and”.

### Example

Suppose we wanted to select all rows where the customer’s age was under 30 or 
the customer’s name was “Martha Jones”

In [96]:
customers_df

           name           address         phone  age
0  Martha Jones      123 Main St.  234-567-8910   28
1    Rose Tyler    456 Maple Ave.  212-867-5309   22
2   Donna Noble      789 Broadway  949-123-4567   35
3      Amy Pond  98 West End Ave.  646-555-1234   29
4  Clara Oswald  54 Columbus Ave.  714-225-1957   31

In [98]:
customers_df[ ( customers_df['age'] < 30 ) | 
              ( customers_df['name'] == 'Martha Jones' ) ]

           name           address         phone  age
0  Martha Jones      123 Main St.  234-567-8910   28
1    Rose Tyler    456 Maple Ave.  212-867-5309   22
3      Amy Pond  98 West End Ave.  646-555-1234   29

# Excercise

You want to see how the number of clinic visits changed between March and April.

Create the variable march_april, which contains the data from March and April. 

Do this using two logical statements combined using |, which means “or”.

In [99]:
health_clinics_df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [100]:
march_april = health_clinics_df[ ( health_clinics_df.month == 'March') |
                                 ( health_clinics_df.month == 'April') ]

In [102]:
print(march_april)

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

# Select Rows with Logic III

In [ ]:
Example

Suppose we want to select the rows where the customer’s name is either “Martha Jones”, “Rose Tyler” or “Amy Pond”.

Use ----> isin( [list] ) command to check that df.name is one of a list of values:

In [107]:
customers_df

           name           address         phone  age
0  Martha Jones      123 Main St.  234-567-8910   28
1    Rose Tyler    456 Maple Ave.  212-867-5309   22
2   Donna Noble      789 Broadway  949-123-4567   35
3      Amy Pond  98 West End Ave.  646-555-1234   29
4  Clara Oswald  54 Columbus Ave.  714-225-1957   31

In [108]:
customers_df[ customers_df['name'].isin( ['Martha Jones', 'Rose Tyler', 'Amy Pond'] ) ]

           name           address         phone  age
0  Martha Jones      123 Main St.  234-567-8910   28
1    Rose Tyler    456 Maple Ave.  212-867-5309   22
3      Amy Pond  98 West End Ave.  646-555-1234   29

# Excercise

Another doctor thinks that you have a lot of clinic visits in the late Winter.

Create the variable january_february_march, containing the data from January, February, and March. 

Do this using a single logical statement with the isin command.

In [109]:
health_clinics_df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [110]:
january_february_march = health_clinics_df[ health_clinics_df['month'].isin( ['January', 'February', 'March'] )]
january_february_march

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

### Question: Cam we pass other types of values to the pandas isin() command otherthan lists ??

In [ ]:
in the case of pandas isin() we can pass as a parameter not only lists, but also dictionaries, and even dataframes.

### Example

In [113]:
animals_df = pd.DataFrame({'num_legs': [2, 4], 'num_wings': [2, 0]},
                  index=['falcon', 'dog'])
animals_df

        num_legs  num_wings
falcon         2          2
dog            4          0

In [ ]:
When values is a list check whether every value in the DataFrame is present in the list `

#### which animals have 0 or 2 legs or wings ??

In [118]:
animals_df.isin([0, 2])

        num_legs  num_wings
falcon      True       True
dog        False       True

In [119]:
# check

animals_df[ animals_df['num_legs'].isin([0,2]) |
            animals_df['num_wings'].isin([0,2]) ]

        num_legs  num_wings
falcon         2          2
dog            4          0

### To check if values is not in the DataFrame, use the ~ operator:

In [121]:
~animals_df.isin([0, 2])

        num_legs  num_wings
falcon     False      False
dog         True      False

#### When values is a dict, we can pass values to check for each column separately:

In [122]:
animals_df.isin({'num_wings': [0, 3]})

        num_legs  num_wings
falcon     False      False
dog        False       True

### which animals have 0 or 2 legs or wings ??

In [125]:
# animals_df[ animals_df['num_legs'].isin([0,2]) |
#             animals_df['num_wings'].isin([0,2]) ] 

# the above query can be simplified using dictionaries as below

animals_df.isin( {'num_legs': [0, 2], 
                  'num_wings': [0, 2]} )

        num_legs  num_wings
falcon      True       True
dog        False       True

# Setting indices  --- .reset_index()

When we select a subset of a DataFrame using logic, we end up with non-consecutive indices. 

This is in-elegant and makes it hard to use .iloc().

We can fix this using the method ---> .reset_index()

In [ ]:
# Setting indices  --- .reset_index()

For example, here is a DataFrame called df with non-consecutive indices:
	First Name	Last Name
0	John	    Smith
4	Jane	    Doe
7	Joe	        Schmo

If we use the command df.reset_index(), we get a new DataFrame with a new set of indices:
   index	First Name	Last Name
0	0	    John	    Smith
1	4	    Jane	    Doe
2	7	    Joe	        Schmo

Note that the old indices have been moved into a new column called 'index'.

Unless you need those values for something special, it’s probably better to use the keyword drop=True so that you don’t end up 
with that extra column.

If we run the command df.reset_index(drop=True), we get a new DataFrame that looks like this:

	First Name	Last Name
0	John	    Smith
1	Jane	    Doe
2	Joe	        Schmo

Using .reset_index() will return a new DataFrame, but we usually just want to modify our existing DataFrame. 
If we use the keyword inplace=True we can just modify our existing DataFrame.

# Excercise

In [127]:
# health_clinics_df2 is a subset of health_clinics_df

health_clinics_df2 = health_clinics_df.loc[[1, 3, 5]]
health_clinics_df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [128]:
health_clinics_df3 = health_clinics_df2.reset_index()
health_clinics_df3

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      3     April           80            80            54          180
2      5      June          112           109            79          129

In [129]:
health_clinics_df2.reset_index(inplace=True, drop=True)

In [130]:
health_clinics_df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1     April           80            80            54          180
2      June          112           109            79          129

# Question

In the context of this exercise 56, when should I generally use the reset_index() method in Pandas?

In [ ]:
You can always use the method any time you’d like, but there are some common situations in which it would be particularly useful to apply.

Situation 1:
============
    
One common situation, which is given in the example text of the exercise, is when the dataframe has non-consecutive indices, 
meaning the indices are not sequential like 0, 1, 2,… and skip some values. 
This can occur when we create a new dataframe by selecting the rows from another dataframe, causing some of the indices to be out of order. 
By using reset_index() it will set the indices in order, starting from 0, and make it easier for us to work with the dataframe.

Situation 2:
============

Another situation you might encounter is when the default index column was changed to some other values other than integers, 
such as the values of another column in the dataframe. 
For example, we might have updated the index column of a dataframe for country populations to be the country names, instead of integers. 
This is possible because in Pandas we have the option to change the index values from the default, integer values, 
to the values of another column in the dataframe, which can be strings or other value types. 

If we need to change the first column back to the integer indices, we can use reset_index().

# Excercise - Practicing learning

In [134]:
orders_df

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987.0,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown
5,52386.0,Julie,Marsh,JulieMarsh59@gmail.com,sandals,fabric,black
6,20487.0,Thomas,Jensen,TJ5470@gmail.com,clogs,fabric,navy
7,76971.0,Janice,Hicks,Janice.Hicks@gmail.com,clogs,faux-leather,navy
8,21586.0,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown
9,62083.0,Frances,Palmer,FrancesPalmer50@gmail.com,wedges,leather,white
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
'''
Your marketing department wants to send out an email blast to everyone who ordered shoes!

Select all of the email addresses from the column email and save them to a variable called emails.

'''

In [133]:
emails = orders_df['email']
emails

0     RebeccaLindsay57@hotmail.com
1           EmilyJoyce25@gmail.com
2           Joyce.Waller@gmail.com
3      Justin.Erickson@outlook.com
4                 AB4318@gmail.com
5           JulieMarsh59@gmail.com
6                 TJ5470@gmail.com
7           Janice.Hicks@gmail.com
8        GabrielPorter24@gmail.com
9        FrancesPalmer50@gmail.com
10                             NaN
Name: email, dtype: object

In [ ]:
'''
Frances Palmer claims that her order was wrong. What did Frances Palmer order?

Use logic to select that row of orders and save it to the variable frances_palmer.

'''

In [139]:
frances_palmer = orders_df[ ( orders_df['first_name'] == 'Frances' ) & 
                            ( orders_df['last_name'] == 'Palmer' ) ]
frances_palmer

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
9,62083.0,Frances,Palmer,FrancesPalmer50@gmail.com,wedges,leather,white

In [ ]:
'''
We need some customer reviews for our comfortable shoes. 

Select all orders for shoe_type: clogs, boots, and ballet flats and save them to the variable comfy_shoes.

'''

In [140]:
comfy_shoes = orders_df[orders_df['shoe_type'].isin(['clogs', 'boots', 'ballet flats'])]
comfy_shoes

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791.0,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450.0,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
3,14437.0,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357.0,Andrew,Banks,AB4318@gmail.com,boots,leather,brown
6,20487.0,Thomas,Jensen,TJ5470@gmail.com,clogs,fabric,navy
7,76971.0,Janice,Hicks,Janice.Hicks@gmail.com,clogs,faux-leather,navy
8,21586.0,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown